// Определить количество цифр в числе
Console.WriteLine("Введите число N");
string S = Console.ReadLine();

Console.WriteLine("Длина вашего числа - " + S.Length + " знаков");